kaaproject/kaa/client/client-multi/client-c/src/kaa/platform-impl/stm32/leafMapleMini/esp8266/esp8266_kaa_client.c
/*
 * Copyright 2015 CyberVision, Inc.
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *      http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 */

/*
 * @file kaa_client.c
 *
 *  Created on: Apr 14, 2015
 *      Author: Andriy Panasenko <apanasenko@cybervisiontech.com>
 */

typedef unsigned char uint8;
typedef unsigned int uint32;

#include <stdbool.h>
#include <stdint.h>
#include <stdlib.h>
#include <string.h>

#include "../leaf_time.h"
#include "../leaf_stdio.h"
#include "../../../../kaa_error.h"
#include "../../../../kaa_common.h"
#include "../../../../kaa.h"
#include "../../../../kaa_context.h"
#include "../../../../kaa_configuration_manager.h"
#include "../../../../utilities/kaa_log.h"
#include "esp8266.h"
#include "chip_specififc.h"
#include "../../../../platform/kaa_client.h"
#include "../../../../platform/ext_sha.h"
#include "../../../../platform/ext_transport_channel.h"
#include "../../../../platform-impl/common/ext_log_upload_strategies.h"
#include "esp8266_kaa_tcp_channel.h"
#include "../../../../plugins/kaa_plugin.h"



#define DEFAULT_ESP8266_CONTROLER_BUFFER_SIZE 512

#define KAA_DEMO_UPLOAD_COUNT_THRESHOLD 1 /* Count of collected serialized logs needed to initiate log upload */

#define KAA_DEMO_TWO_DAYS_UPLOAD_TIMEOUT 2 * 24 * 60 * 60



static kaa_digest kaa_public_key_hash;

static uint16_t BOOTSTRAP_PLUGIN[] = { KAA_PLUGIN_BOOTSTRAP };
static const int BOOTSTRAP_PLUGIN_COUNT = sizeof(BOOTSTRAP_PLUGIN) / sizeof(uint16_t);
/*
* Define services which should be used.
* Don't define unused services, it may cause an error.
*/
static uint16_t OPERATIONS_PLUGIN[] = {    KAA_PLUGIN_PROFILE
                                         , KAA_PLUGIN_CONFIGURATION
                                         , KAA_PLUGIN_USER
                                         , KAA_PLUGIN_EVENT
                                         , KAA_PLUGIN_LOGGING};
static const int OPERATIONS_PLUGIn_COUNT = sizeof(OPERATIONS_PLUGIN) / sizeof(uint16_t);



typedef enum {
    KAA_CLIENT_ESP8266_STATE_UNINITED = 0,
    KAA_CLIENT_ESP8266_STATE_INIT_OK,
    KAA_CLIENT_WIFI_STATE_UNCONNECTED,
    KAA_CLIENT_WIFI_STATE_CONNECTED,
} kaa_client_connection_state_t;

typedef enum {
    KAA_CLIENT_CHANNEL_STATE_NOT_CONNECTED = 0,
    KAA_CLIENT_CHANNEL_STATE_CONNECTED,
} kaa_client_channel_state_t;

typedef enum {
    KAA_CLIENT_CHANNEL_TYPE_BOOTSTRAP = 0,
    KAA_CLIENT_CHANNEL_TYPE_OPERATIONS,
} kaa_client_channel_type_t;

struct kaa_client_t {
    kaa_client_connection_state_t         connection_state;
    esp8266_t                             *controler;
    kaa_context_t                         *kaa_context;
    bool                                  operate;
    kaa_transport_channel_interface_t     channel;
    kaa_client_channel_state_t            channel_state;
    uint32_t                              channel_id;
    int                                   channel_fd;
    bool                                  boostrap_complete;
    external_process_fn                   external_process_fn;
    void                                  *external_process_context;
    time_t                                external_process_max_delay;
    time_t                                external_process_last_call;
    const char                            *wifi_ssid;
    const char                            *wifi_pswd;
    void                                  *log_storage_context;
    void                                  *log_upload_strategy_context;
    uint32_t                              blink_timeout;
    uint8                                 blink_prev;
};



kaa_error_t kaa_client_esp8266_error(kaa_client_t *kaa_client);
kaa_error_t kaa_init_security_stuff(const char *kaa_public_key, const size_t kaa_public_key_length);
kaa_error_t kaa_client_channel_error(kaa_client_t *kaa_client);
kaa_error_t kaa_client_init_channel(kaa_client_t *kaa_client, kaa_client_channel_type_t channel_type);
kaa_error_t kaa_client_deinit_channel(kaa_client_t *kaa_client);



void esp8266_tcp_receive_fn(void *context, int id, const uint8 *buffer, const int receive_size)
{
    if (!context)
        return;

    kaa_client_t *kaa_client = (kaa_client_t *)context;
    kaa_error_t error;

    if (buffer) {
        if (receive_size > 0) {
            KAA_LOG_TRACE(kaa_client->kaa_context->logger, KAA_ERR_NONE, "Kaa channel(0x%08X) receive %d bytes",
                                                                            kaa_client->channel_id, receive_size);
            error = kaa_tcp_channel_read_bytes(&kaa_client->channel, buffer, receive_size);
            if (error) {
                KAA_LOG_ERROR(kaa_client->kaa_context->logger, error, "Kaa channel error reading bytes");
            }
        }

    }
    if (receive_size == -1) {
       KAA_LOG_TRACE(kaa_client->kaa_context->logger, KAA_ERR_NONE, "Kaa channel(0x%08X) connection termined by peer",
                                                                                               kaa_client->channel_id);
        error = kaa_client_channel_error(kaa_client);
       if (error) {
           KAA_LOG_ERROR(kaa_client->kaa_context->logger, error, "Kaa channel error dropping connection");
       }

   }
}

kaa_error_t kaa_client_state_process(kaa_client_t *kaa_client)
{
    KAA_RETURN_IF_NIL(kaa_client, KAA_ERR_BADPARAM);

    kaa_error_t error_code = KAA_ERR_NONE;
    esp8266_error_t esp8266_error;
    switch (kaa_client->connection_state) {
    case KAA_CLIENT_ESP8266_STATE_UNINITED:
        esp8266_error = esp8266_init(kaa_client->controler);
        if (esp8266_error == ESP8266_ERR_NONE) {
            kaa_client->connection_state = KAA_CLIENT_ESP8266_STATE_INIT_OK;
            KAA_LOG_INFO(kaa_client->kaa_context->logger, KAA_ERR_NONE, "ESP8266 initialized successfully");
        } else {
            KAA_LOG_ERROR(kaa_client->kaa_context->logger, KAA_ERR_NONE, "ESP8266 initialization failed: %d", esp8266_error);
            esp8266_reset();
        }
        break;
    case KAA_CLIENT_ESP8266_STATE_INIT_OK:
        ledOn();
        esp8266_error = esp8266_connect_wifi(kaa_client->controler,
                kaa_client->wifi_ssid, kaa_client->wifi_pswd);
        if (esp8266_error == ESP8266_ERR_NONE) {
            kaa_client->connection_state = KAA_CLIENT_WIFI_STATE_CONNECTED;
            KAA_LOG_INFO(kaa_client->kaa_context->logger, KAA_ERR_NONE, "ESP8266 WiFi to %s network connected",
                                                                                        kaa_client->wifi_ssid);
        } else {
            KAA_LOG_ERROR(kaa_client->kaa_context->logger, KAA_ERR_NONE, "ESP8266 connect to WiFi %s failed: %d",
                                                                                kaa_client->wifi_ssid, esp8266_error);
            kaa_client->connection_state = KAA_CLIENT_WIFI_STATE_UNCONNECTED;
        }
        ledOff();
        break;
    case KAA_CLIENT_WIFI_STATE_CONNECTED:
        break;
    default:
        kaa_client->connection_state = KAA_CLIENT_ESP8266_STATE_UNINITED;
        break;
    }

    return error_code;
}

