kaaproject/kaa/client/client-multi/client-c/src/kaa/platform-impl/stm32/leafMapleMini/esp8266/esp8266_kaa_client.c
kaa_error_t kaa_client_create(kaa_client_t **kaa_client, kaa_client_props_t *props)
{
    KAA_RETURN_IF_NIL2(kaa_client, props, KAA_ERR_BADPARAM);

    kaa_error_t error_code = KAA_ERR_NONE;

    kaa_client_t *self = calloc(1, sizeof(kaa_client_t));
    KAA_RETURN_IF_NIL(self, KAA_ERR_NOMEM);

    esp8266_error_t esp8266_error = esp8266_create(&self->controler, props->serial, DEFAULT_ESP8266_CONTROLER_BUFFER_SIZE);
    if (esp8266_error) {
        debug("Error during esp8266 creation %d\n", esp8266_error);
        kaa_client_destroy(self);
        return KAA_ERR_BADDATA;
    }

    esp8266_error = esp8266_tcp_register_receive_callback(self->controler, esp8266_tcp_receive_fn, (void *)self);
    if (esp8266_error) {
        debug("Error during esp8266 registering receive callback %d\n", esp8266_error);
        kaa_client_destroy(self);
        return KAA_ERR_BADDATA;
    }

    error_code = kaa_init_security_stuff(props->kaa_public_key, props->kaa_public_key_length);
    if (error_code) {
        debug("Error generate SHA1 diges form Public Key, error %d", error_code);
        kaa_client_destroy(self);
        return error_code;
    }

    error_code = kaa_init(&self->kaa_context);
    if (error_code) {
        debug("Error during Kaa context creation %d\n", error_code);
        kaa_client_destroy(self);
        return error_code;
    }

    KAA_LOG_INFO(self->kaa_context->logger, KAA_ERR_NONE, "Kaa framework initialized.");

    self->wifi_ssid = props->wifi_ssid;
    self->wifi_pswd = props->wifi_pswd;
    self->operate = true;
    self->blink_timeout = 500;

    kaa_plugin_t *plugin;
    kaa_plugin_find_by_type(self->kaa_context, KAA_PLUGIN_LOGGING, &plugin);
    error_code = plugin->last_error;
    if (error_code) {
        KAA_LOG_ERROR(self->kaa_context->logger, error_code, "Failed to init Kaa log collector %d", error_code);
        kaa_client_destroy(self);
        return error_code;
    }

    KAA_LOG_INFO(self->kaa_context->logger, KAA_ERR_NONE, "Kaa log collector initialized.");

    *kaa_client = self;

    return error_code;
}

void kaa_client_destroy(kaa_client_t *self)
{
    if (!self)
        return;

    self->controler = NULL;

    if (self->channel.context) {
        self->channel.destroy(self->channel.context);
        self->channel.context = NULL;
    }

    if (self->channel.context) {
        self->channel.destroy(self->channel.context);
        self->channel.context = NULL;
    }

    if (self->log_storage_context) {
        ext_log_storage_destroy(self->log_storage_context);
        self->log_storage_context = NULL;
    }

    if (self->kaa_context) {
        kaa_deinit(self->kaa_context);
        self->kaa_context = NULL;
    }

    free(self);
}

kaa_context_t* kaa_client_get_context(kaa_client_t *kaa_client)
{
    KAA_RETURN_IF_NIL(kaa_client, NULL);
    return kaa_client->kaa_context;
}

kaa_error_t configuration_update(void *context, const kaa_root_configuration_t *configuration)
{
    KAA_RETURN_IF_NIL(context, KAA_ERR_BADPARAM);
    KAA_LOG_INFO(((kaa_client_t *)context)->kaa_context->logger, KAA_ERR_NONE, "New configuration received");
    return KAA_ERR_NONE;
}


kaa_error_t kaa_client_process_channel_connected(kaa_client_t *kaa_client)
{
    KAA_RETURN_IF_NIL(kaa_client, KAA_ERR_BADPARAM);

    kaa_error_t error_code = KAA_ERR_NONE;
    esp8266_error_t esp_error = ESP8266_ERR_NONE;


    error_code = kaa_tcp_channel_check_keepalive(&kaa_client->channel);
    if (error_code) {
        KAA_LOG_ERROR(kaa_client->kaa_context->logger, error_code, "Kaa tcp channel error check keepalive");
    }

    int tmp = (get_sys_milis() / kaa_client->blink_timeout) % 2;
    if (kaa_client->blink_prev != (uint8)tmp) {
        kaa_client->blink_prev = (uint8)tmp;
        if (kaa_client->blink_prev) {
            ledOn();
            if (kaa_client->boostrap_complete) {
                KAA_LOG_INFO(kaa_client->kaa_context->logger, KAA_ERR_NONE, "Process Bootstrap channel, state connected");
            } else {
                KAA_LOG_INFO(kaa_client->kaa_context->logger, KAA_ERR_NONE, "Process Operation channel, state connected");
            }
        } else
            ledOff();
    }

    uint8 * buffer = NULL;
    size_t buffer_size = 0;
    error_code = kaa_tcp_channel_get_buffer_for_send(&kaa_client->channel, &buffer, &buffer_size);
    if (error_code) {
        KAA_LOG_ERROR(kaa_client->kaa_context->logger, error_code, "Kaa tcp channel get buffer for send failed");
        kaa_client_channel_error(kaa_client);
    }
    if (buffer_size > 0) {
        esp_error = esp8266_send_tcp(kaa_client->controler, kaa_client->channel_fd, buffer, buffer_size);
        if (esp_error) {
            if (esp_error != ESP8266_ERR_COMMAND_BUSY) {
                KAA_LOG_ERROR(kaa_client->kaa_context->logger,
                        KAA_ERR_NONE, "ESP8266 send tcp failed, code: %d", esp_error);
                kaa_client_channel_error(kaa_client);
            }
        } else {
            KAA_LOG_TRACE(kaa_client->kaa_context->logger, KAA_ERR_NONE,
                    "Channel(0x%08X) sending %lu bytes", kaa_client->channel_id, buffer_size);
            error_code = kaa_tcp_channel_free_send_buffer(&kaa_client->channel, buffer_size);
            if (error_code) {
                KAA_LOG_ERROR(kaa_client->kaa_context->logger, error_code, "Kaa tcp channel error free buffer");
            }
        }
    }
    if (kaa_tcp_channel_connection_is_ready_to_terminate(&kaa_client->channel)) {
        esp_error = esp8266_disconnect_tcp(kaa_client->controler, kaa_client->channel_fd);
        if (esp_error) {
            KAA_LOG_ERROR(kaa_client->kaa_context->logger, KAA_ERR_NONE, "ESP8266 send tcp failed, code: %d", esp_error);
        }
        KAA_LOG_INFO(kaa_client->kaa_context->logger, KAA_ERR_NONE,
                    "Channel(0x%08X) connection terminated", kaa_client->channel_id);

        error_code = kaa_client_channel_error(kaa_client);
        if (error_code) {
            KAA_LOG_ERROR(kaa_client->kaa_context->logger, error_code, "Kaa tcp channel error");
        }
    }


    return error_code;
}

kaa_error_t kaa_client_process_channel_disconnected(kaa_client_t *kaa_client)
{
    KAA_RETURN_IF_NIL(kaa_client, KAA_ERR_BADPARAM);

    kaa_error_t error_code = KAA_ERR_NONE;
    esp8266_error_t esp_error = ESP8266_ERR_NONE;

